[
  {
    "id": 1,
    "name": "home",
    "c1": 2,
    "c2": 3,
    "c3": 20,
    "story": "One day, you wake up at home and want to go on Wonderland Amusement Park",
    "nav": "press 2 to go to the parking lot, press 3 to go to ticket counter, press 20 to go to WonderLand's technical room",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 2,
    "name": "parking lot",
    "c1": 1,
    "c2": 3,
    "c3": 17,
    "story": "You are in the parking lot",
    "nav": "press 1 to go back home,  press 3 to go ticket counter, press 17 to go to cafeteria",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 3,
    "name": "ticket counter",
    "c1": 1,
    "c2": 2,
    "c3": 4,
    "story": "From ticket counter, get your tickets and enjoy your journey",
    "nav": "press 1 to go back home, press 2 to go to parking lot, press 4 to go to drop tower",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 4,
    "name": "drop tower",
    "c1": 1,
    "c2": 6,
    "c3": 7,
    "story": "you are in drop tower room, careful!! This ride can be dangerous and you need doctor's help if you have health issues",
    "nav": "press 1 to go to back to home, press 6 to go to the mysterious room, press 7 to go to movie room",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 5,
    "name": "doctor's clinic",
    "c1": 1,
    "c2": 7,
    "c3": 8,
    "story": "you are in doctor'clinic. Get first aid and relax",
    "nav": "press 1 to go to back to home,press 7 to go to the movie room, press 8 to go to coffee shop.",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 6,
    "name": "Mysterious chamber",
    "c1": 1,
    "c2": 9,
    "c3": 10,
    "story": "You are in mysterious chamber. Here you will experience surprises. You may encounter with 3 random events that is 10% chance of having sandwich to boost energy, 20 %chance to encounter a menacing creature in this room and 2 % chanceto find a bag of gold",
    "nav": "press 1 to go to back to home, press 9 to goto the Dragon ride,  press 10 to go to Badminton court",
    "win": 0,
    "lose": 0,
    "stranger": 1
  },
  {
    "id": 7,
    "name": "movie room",
    "c1": 1,
    "c2": 2,
    "c3": 8,
    "story": "You are at the movie room, you can check your fav show's episodes",
    "nav": "press 1 to go to back to home, press 2 to go to parking lot,  press 8 to go to coffee shop",
    "win": 0,
    "lose": 0,
    "stranger": 2
  },
  {
    "id": 8,
    "name": "coffee shop",
    "c1": 1,
    "c2": 9,
    "c3": 10,
    "story": "You are in coffee shop, have some coffee.",
    "nav": "press 1 to go to back to home, press 9 to go to dragon ride, press 10 to go to the badminton court",
    "win": 0,
    "lose": 0,
    "stranger": 1
  },
  {
    "id": 9,
    "name": "Dragon ride",
    "c1": 1,
    "c2": 11,
    "c3": 10,
    "story": "you are in the waitng row to have dragon ride.",
    "nav": "press 1 to go to back to home, press 11 to eat chicken,press 10 to go to Badminton court",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 10,
    "name": "Badminton court",
    "c1": 1,
    "c2": 7,
    "c3": 11,
    "story": "you are in the badminton court, play and enjoy it.",
    "nav": "press 1 to go to back to home, press 7 to go to the movie room,press 11 to eat chicken.",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 11,
    "name": "Eat chicken",
    "c1": 1,
    "c2": 12,
    "c3": 13,
    "story": "You are going to eat chicken, have some food.",
    "nav": "press 1 to go to back to home, press 12 to go to the Live show  ,press 13 to go to the Ice Skating Ring",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 12,
    "name": "Live show",
    "c1": 1,
    "c2": 18,
    "c3": 8,
    "story": "You are in live show area, enjoy !!",
    "nav": "press 1 to go to back to home, Press 18 to go to  game zone,    press 8 to go to coffee shop",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 13,
    "name": "Ice skating ring",
    "c1": 1,
    "c2": 14,
    "c3": 15,
    "story": "You are visiting the Ice Skating Ring",
    "nav": "press 1 to go to back to home, Press 14 to go to the Dark trading room, Press 15 to go to the monster truck ride",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 14,
    "name": "Dark trading room",
    "c1": 1,
    "c2": 15,
    "c3": 20,
    "story": "You found yourself in trading room  and there is darkness around you. So you need do buy and sell items to get out of this room, also need to interact with gambler and merchant",
    "nav": "press 1 to go to back to home,Press 15 to go to the monster truck ride,  Press 20 to go to theWonderLand's technical room",
    "win": 0,
    "lose": 0,
    "stranger": 3
  },
  {
    "id": 15,
    "name": "monster truck ride",
    "c1": 1,
    "c2": 16,
    "c3": 18,
    "story": "You decide to visit the monster truck ride",
    "nav": "press 1 to go to back to home, press 16 to go to the waterpool ride and press 18 to go to the game zone",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 16,
    "name": "waterpool ride",
    "c1": 1,
    "c2": 2,
    "c3": 17,
    "story": "You are in the waterpool ride.",
    "nav": "press 1 to go to back to home, 2 to go back to parking lot, 17 to go to Cafeteria",
    "win": 0,
    "lose": 0,
    "stranger": 1
  },
  {
    "id": 17,
    "name": "Cafeteria",
    "c1": 1,
    "c2": 18,
    "c3": 19,
    "story": "You are in Cafeteria",
    "nav": "Press 1 to go back to home, 18 to go back to Game zone, 19 to go to play Area",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 18,
    "name": "Game zone",
    "c1": 1,
    "c2": 19,
    "c3": 20,
    "story": "You are in game zone, play shot the target to win prices.",
    "nav": "press 1 to go to back to home, press 19 to go to play Area, press 20 to go to WonderLand's technical room",
    "win": 0,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 19,
    "name": "play Area",
    "c1": "",
    "c2": "",
    "c3": "",
    "story": "You have shot the target and won a price.",
    "nav": "",
    "win": 1,
    "lose": 0,
    "stranger": 0
  },
  {
    "id": 20,
    "name": "WonderLand's technical room",
    "c1": "",
    "c2": "",
    "c3": "",
    "story": "You are not authorized to be here you lose, You will be thrown out of wonderLand park!",
    "nav": "",
    "win": 0,
    "lose": 1,
    "stranger": 0
  }
]